choonpal/parkingbot/stm32/parking_robot/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MOTOR1_DIR_Pin GPIO_PIN_0
#define MOTOR1_DIR_GPIO_Port GPIOC
#define MOTOR2_DIR_Pin GPIO_PIN_1
#define MOTOR2_DIR_GPIO_Port GPIOC
#define MOTOR3_DIR_Pin GPIO_PIN_2
#define MOTOR3_DIR_GPIO_Port GPIOC
#define MOTOR4_DIR_Pin GPIO_PIN_3
#define MOTOR4_DIR_GPIO_Port GPIOC
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define ULTRASONIC2_TRIG_Pin GPIO_PIN_5
#define ULTRASONIC2_TRIG_GPIO_Port GPIOC
#define ULTRASONIC1_ECHO_Pin GPIO_PIN_6
#define ULTRASONIC1_ECHO_GPIO_Port GPIOC
#define ULTRASONIC1_ECHO_EXTI_IRQn EXTI9_5_IRQn
#define ULTRASONIC2_ECHO_Pin GPIO_PIN_7
#define ULTRASONIC2_ECHO_GPIO_Port GPIOC
#define ULTRASONIC2_ECHO_EXTI_IRQn EXTI9_5_IRQn
#define ULTRASONIC1_TRIG_Pin GPIO_PIN_8
#define ULTRASONIC1_TRIG_GPIO_Port GPIOC
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
